a, b = input().split()
# переводим буквы в числа (a=1, b=2, c=3 и т.д.)
# ищем букву в строке "abcdefgh" и прибавляем 1
x1 = "abcdefgh".find(a[0]) + 1
x2 = "abcdefgh".find(b[0]) + 1
# берем цифры (номера строк) и переводим их в целые числа
y1 = int(a[1])
y2 = int(b[1])
# считаем, на сколько клеток конь сместился по горизонтали (dx) и вертикали (dy)
dx = abs(x1 - x2)
dy = abs(y1 - y2)
# проверяем правило коня:
# смещение должно быть 2 по одной оси и 1 по другой.
if (dx == 2 and dy == 1):
    print("верно")
elif (dx == 1 and dy == 2):
    print("верно")
else:
    print("ошибка")