p = int(input())
if p == 1:
    print(0)
# однозначные числа (позиции 2-10)
elif p <= 10:
    print(p - 1)
# двузначные числа (позиции 11-190)
elif p <= 190:
    o = p - 11  # сдвиг позиции
    num = 10 + o // 2  # само число
    if o % 2 == 0:
        print(num // 10)  # первая цифра
    else:
        print(num % 10)  # вторая цифра

# трехзначные числа (позиции от 191)
else:
    o = p - 191  # сдвиг позиции
    num = 100 + o // 3  # само число
    r = o % 3  # остаток

    if r == 0:
        print(num // 100)
    elif r == 1:
        print((num // 10) % 10)
    else:
        print(num % 10)