a = str(input("Собака короткошерстной породы?"))
if a == "да":
    b = str(input("Рост собаки менее 50 см?"))
    if b == "да":
        c = str(input("У собаки собаки короткий хвост?"))
        if c == "да":
            print("английский бульдог")
        elif c == "нет":
            d = str(input("У собаки длинные уши?"))
            if d == "да":
                print("гончая")
            else:
                e = str(input("У собки короткое тело?"))
                if e == "да":
                    print ("мопс")
                else:
                    print("чихуахуа")
    else:
        f = str(input("Собака весит более 50 кг?"))
        if f == "да":
            print("датский дог")
        else:
            print("фоксаунд")
else:
    g = str(input("Рост собаки менее 50 см?"))
    if g == "да":
         h = str(input("У собаки доброжелательный характер?"))
         if h == "да":
             print("окер-спаниэль")
         else:
             print("ирланский сеттер")
    else:
        i = str(input("У собаки рост мнее 70 см?"))
        if i == "да":
            j = str(input("У собаки длнные уши"))
            if j == "да":
                print("большой вандейский грифон")
            else:
                print("колли")
        else:
            o = str(input("Окрас рыжий с белыми отметинами?"))
            if o == "да":
                print("сенбернар")
            else:
                p = str(input("Белоснежный окрас?"))
                if p == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")